CREATE INDEX idx_vedomosti ON "Н_ОЦЕНКИ" USING BTREE("КОД");

SELECT
    tablename,
    attname,
    n_distinct,
    null_frac,
    avg_width,
    correlation
FROM pg_stats
WHERE tablename = 'Н_СЕССИЯ'
  AND attname = 'ЧЛВК_ИД';



-- Сделать запрос для получения атрибутов из указанных таблиц, применив фильтры по указанным условиям:
-- Таблицы: Н_ОЦЕНКИ, Н_ВЕДОМОСТИ.
-- Вывести атрибуты: Н_ОЦЕНКИ.КОД, Н_ВЕДОМОСТИ.ИД.
-- Фильтры (AND):
-- a) Н_ОЦЕНКИ.КОД < 4.
-- b) Н_ВЕДОМОСТИ.ЧЛВК_ИД < 153285.
-- Вид соединения: INNER JOIN.

EXPLAIN ANALYSE SELECT
    "Н_ОЦЕНКИ"."КОД",
    "Н_ВЕДОМОСТИ"."ИД"
FROM "Н_ОЦЕНКИ" JOIN "Н_ВЕДОМОСТИ" ON "Н_ВЕДОМОСТИ"."ОЦЕНКА" = "Н_ОЦЕНКИ"."КОД"
WHERE
    ("Н_ОЦЕНКИ"."КОД" ~ '^[0-9]+$' AND "Н_ОЦЕНКИ"."КОД"::int < 4)
  AND "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" < 153285


-- Сделать запрос для получения атрибутов из указанных таблиц, применив фильтры по указанным условиям:
-- Таблицы: Н_ЛЮДИ, Н_ВЕДОМОСТИ, Н_СЕССИЯ.
-- Вывести атрибуты: Н_ЛЮДИ.ИД, Н_ВЕДОМОСТИ.ЧЛВК_ИД, Н_СЕССИЯ.ДАТА.
-- Фильтры (AND):
-- a) Н_ЛЮДИ.ОТЧЕСТВО < Сергеевич.
-- b) Н_ВЕДОМОСТИ.ДАТА = 2010-06-18.
-- c) Н_СЕССИЯ.ЧЛВК_ИД > 100012.
-- Вид соединения: INNER JOIN.

EXPLAIN ANALYSE SELECT
    "Н_ЛЮДИ"."ИД",
    "Н_ВЕДОМОСТИ"."ЧЛВК_ИД",
    "Н_СЕССИЯ"."ДАТА"
FROM "Н_ЛЮДИ"
    JOIN "Н_ВЕДОМОСТИ" ON "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
    JOIN "Н_СЕССИЯ" ON "Н_СЕССИЯ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
WHERE
    "Н_ЛЮДИ"."ОТЧЕСТВО" < 'Сергеевич' AND
    "Н_ВЕДОМОСТИ"."ДАТА" = '2010-06-18'::date AND
    "Н_СЕССИЯ"."ЧЛВК_ИД" > 100012